netify-soap/src/test/resources/soap/requests/movie/UpdateMovieRemoveGenreRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://mouthaan.org/namespace/netify/general" xmlns:gen1="http://mouthaan.org/namespace/netify/datatypes/genre">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:UpdateMovieRemoveGenreRequest>
            <gen:movieId>11</gen:movieId>
            <gen:genre>
                <gen1:name>Comedy</gen1:name>
            </gen:genre>
            <gen:genre>
                <gen1:name>Does not Exist</gen1:name>
            </gen:genre>
        </gen:UpdateMovieRemoveGenreRequest>
    </soapenv:Body>
</soapenv:Envelope>